app/controllers/dnis_controller.rb

  def index
    @dnis = Dni.paginate(:page => (params[:page] || 1), :order => :value)
---
SELECT * FROM `dnis` ORDER BY value LIMIT 0, 30
SELECT count(*) AS count_all FROM `dnis`

  def load
    if request.post?
      if params[:file]
        dnis = params[:file].readlines

        dnis.each do |dni|
          Dni.create(:value => dni.strip!)
---
INSERT INTO `dnis` (`updated_at`, `value`, `created_at`) VALUES('2009-06-16 18:07:14', '75103544A\n', '2009-06-16 18:07:14')

  def create
    @dni = Dni.new(params[:dni])

    if @dni.save
---
INSERT INTO `dnis` (`updated_at`, `value`, `created_at`) VALUES('2009-06-16 17:39:24', 'hola hola', '2009-06-16 17:39:24')

  def destroy
    @dni = Dni.find(params[:id])
    @dni.destroy
---
SELECT * FROM `dnis` WHERE (`dnis`.`id` = 1)
DELETE FROM `dnis` WHERE `id` = 1