app/controllers/tests_controller.rb

SELECT * FROM `tests` LIMIT 0, 10
SELECT count(*) AS count_all FROM `tests`
---
  def index
    @tests = Test.paginate(:page => (params[:page] || 1))

SELECT * FROM `tests` WHERE (`tests`.`id` = 1)
SELECT * FROM `user_solutions` WHERE (`user_solutions`.`test_id` = 1) AND (`user_solutions`.user_id = 1) ORDER BY created_at DESC LIMIT 1
---
  def show
    @test = Test.find(params[:id])
    @user_solution = UserSolution.new

    if (recent_user_solution = current_user.find_recent_solution_to_test(@test.id)) &&
        recent_user_solution.right?

SELECT * FROM `tests` WHERE (`tests`.`id` = 1)
SELECT * FROM `user_solutions` WHERE (`user_solutions`.`test_id` = 1) AND (`user_solutions`.user_id = 1) ORDER BY created_at DESC LIMIT 1
INSERT INTO `user_solutions` (`test_id`, `updated_at`, `title`, `value`, `user_id`, `right`, `created_at`) VALUES(1, '2009-06-21 17:31:24', NULL, '--- \n- 1.0\n- 2.0\n- 3.0\n- 4.0\n- 5.0\n', 1, NULL, '2009-06-21 17:31:24')
SELECT * FROM `calmat_solutions` WHERE (`calmat_solutions`.`user_id` = 1 AND `calmat_solutions`.`test_id` = 1) LIMIT 1
---
  def solve
    @test = Test.find(params[:id])
    @user_solution = UserSolution.new(:user_id => current_user.id,
      :test_id => @test.id,
        :value => params[:user_solution][:value])

    if (recent_user_solution = current_user.find_recent_solution_to_test(@test.id)) &&
        recent_user_solution.right?
      flash[:error] = 'Ya has resuelto correctamente esa pr&aacute;ctica, no puedes volver a intentarlo'
      redirect_to tests_path
    end

    if @user_solution.save
      # Buscamos el resultado de calmat a la práctica para compararla
      calmat_solution = CalmatSolution.find_by_test_id_and_user_id(@test.id, current_user.id)

UPDATE `user_solutions` SET `value` = '--- \n- 1.0\n- 2.0\n- 3.0\n- 4.0\n- 5.0\n', `right` = 1, `updated_at` = '2009-06-21 17:51:20' WHERE `id` = 4
---
         flash[:error] = 'Bajate el enunciado antes de meter los resultados'
      end

      @user_solution.save

SELECT * FROM `tests` WHERE (`tests`.`id` = 1)
SELECT * FROM `calmat_solutions` WHERE (`calmat_solutions`.`user_id` = 1 AND `calmat_solutions`.`test_id` = '1') LIMIT 1
INSERT INTO `calmat_solutions` (`test_id`, `updated_at`, `value`, `user_id`, `created_at`) VALUES(1, '2009-06-21 17:58:53', '--- \n- 1.0\n- 2.0\n- 3.0\n- 4.0\n- 5.0\n', 1, '2009-06-21 17:58:53')
---
  def download
    test = Test.find(params[:id])

    # Creación del directorio de trabajo para el usuario
    FileUtils.mkdir_p "#{test.data_dir}/#{current_user.dni}"

    # Generación de las plantillas para el ususario
    latex_filepath = test.data_dir + "/#{current_user.dni}/" +
      test.latex_filename_for(current_user)
    File.open(latex_filepath, 'w+') do |f|
      f.write(test.latex_template(current_user))
    end

    data_filepath = test.data_dir + "/#{current_user.dni}/" +
      test.data_filename_for(current_user)
    File.open(data_filepath, 'w+') do |f|
      f.write(test.data_template(current_user))
    end

    # Invocación al ejecutable de calmat si es que no existe una solución previa
       # data_filepath es el path del archivo datos del alumno que se genera a partir del generico (que es ej.dat.erb) cuando se han sustitudo los datos del alumno
       # test.data_dir es el directorio donde guardamos los erb de ese test y las imágenes
    unless CalmatSolution.find_by_test_id_and_user_id(params[:id], current_user.id)
      system("cd #{test.data_dir}/#{current_user.dni}; echo \"#{test.data_filename_for(current_user)}\" | #{RAILS_ROOT}/app/calmat > fichero.rsl")
      calmat_solution = CalmatSolution.new(:test_id => test.id, :user_id => current_user.id)
      File.open(test.data_dir + "/#{current_user.dni}/fichero.rsl", 'r') do |f|
        calmat_solution.value = f.readlines.map(&:strip).join(', ')
      end
      calmat_solution.save

SELECT * FROM `tests` WHERE (`tests`.`id` = 1)
---
  def edit
    @test = Test.find(params[:id])

INSERT INTO `tests` (`updated_at`, `title`, `latex_filename`, `data_filename`, `description`, `created_at`) VALUES('2009-06-21 17:25:08', 'Práctica N1', 'examen.tex.erb', 'plantilla.dat.erb', 'Esta es la primera práctica del curso. Como tal, es muy fácil.', '2009-06-21 17:25:08')
---
  def create
    @test = Test.new(params[:test])

    if @test.save

SELECT * FROM `tests` WHERE (`tests`.`id` = 1)
UPDATE `tests` SET `description` = 'Esta es la primera práctica del curso. Como tal, es muy fácil ...', `updated_at` = '2009-06-21 18:06:36' WHERE `id` = 1
---
  def update
    @test = Test.find(params[:id])

    if @test.update_attributes(params[:test])

SELECT * FROM `tests` WHERE (`tests`.`id` = 2)
DELETE FROM `tests` WHERE `id` = 2
---
  def destroy
    @test = Test.find(params[:id])
    @test.destroy