app/controllers/users_controller.rb

SELECT * FROM `users` WHERE (admin = 0) ORDER BY login LIMIT 0, 30
---
  def index
    @users = User.paginate(:page => (params[:page] || 1),
      :order => :login)#, :conditions => 'admin = 0')

SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1
SELECT * FROM `user_solutions` WHERE (`user_solutions`.`test_id` = 1) AND (`user_solutions`.user_id = 1) ORDER BY created_at DESC LIMIT 1
SELECT * FROM `tests` WHERE (`tests`.`id` = 1)
---
  def show
    @user = User.find(params[:id])

    @user_solutions_full = UserSolution.find_all_by_user_id(@user.id,
      :order => 'test_id ASC', :include => :test)

    @user_solutions = Test.find(:all).map do |test|

DELETE FROM `users` WHERE `id` = 2
---
  def delete_all
    User.destroy_all 'admin = 0 or admin is null'

SELECT * FROM `dnis` WHERE (`dnis`.`value` = '') LIMIT 1
INSERT INTO `users` (`name`, `salt`, `created_at`, `activated_at`, `crypted_password`, `remember_token_expires_at`, `updated_at`, `activation_code`, `admin`, `remember_token`, `login`, `email`) VALUES('', 'f795c669353b4393d11ef960546a57f4738f298a', '2009-09-21 10:26:24', NULL, '1c624c7706ba451c8b4f2f91983b704480f138f3', NULL, '2009-09-21 10:26:24', '09081bd61b85776d2fe600566773b2c1aab5ab53', NULL, NULL, '74111111z', 'pedrito@hotmail.com')
SELECT `users`.id FROM `users` WHERE (`users`.`login` = BINARY '') LIMIT 1
---
  def create
    logout_keeping_session!

    @user = User.new(params[:user])

    # Si el DNI del usuario no se encuentra en el listado no intentamos registrarlo
    if Dni.find_by_value(@user.login)
      success = @user && @user.save
      if success && @user.errors.empty?

SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1
UPDATE `users` SET `activated_at` = '2010-04-07 19:04:27', `activation_code` = NULL, `updated_at` = '2010-04-07 19:04:27' WHERE `id` = 3
---
  def force_activation
    @user = User.find(params[:id])

    @user.activated_at = Time.now.utc
    @user.activation_code = nil
    @user.save(false)